#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.azure_sql.azurerm_mssql_database.main has been deleted
  - resource "azurerm_mssql_database" "main" {
      - id                                                         = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/mssqlserver020rojwk/databases/sqldb-020rojwk" -> null
        name                                                       = "sqldb-020rojwk"
        tags                                                       = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
        # (16 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.azure_sql.azurerm_mssql_server.main has been deleted
  - resource "azurerm_mssql_server" "main" {
      - id                                       = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/mssqlserver020rojwk" -> null
        name                                     = "mssqlserver020rojwk"
        tags                                     = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
        # (13 unchanged attributes hidden)
    }

  # module.azure_sql.azurerm_resource_group.main has been deleted
  - resource "azurerm_resource_group" "main" {
        id       = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure"
      - location = "southindia" -> null
      - name     = "rg-infrastructure" -> null
        tags     = {
            "Environment" = "Dev"
            "ManagedBy"   = "Terraform"
            "Service"     = "terraform-managed"
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.azure_sql.azurerm_mssql_database.main will be created
  + resource "azurerm_mssql_database" "main" {
      + auto_pause_delay_in_minutes                                = (known after apply)
      + collation                                                  = (known after apply)
      + create_mode                                                = "Default"
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      + geo_backup_enabled                                         = true
      + id                                                         = (known after apply)
      + ledger_enabled                                             = (known after apply)
      + license_type                                               = (known after apply)
      + maintenance_configuration_name                             = (known after apply)
      + max_size_gb                                                = (known after apply)
      + min_capacity                                               = (known after apply)
      + name                                                       = "sqldb-020rojwk"
      + read_replica_count                                         = (known after apply)
      + read_scale                                                 = (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      + server_id                                                  = (known after apply)
      + sku_name                                                   = "Basic"
      + storage_account_type                                       = "Geo"
      + tags                                                       = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
      + transparent_data_encryption_enabled                        = true
      + transparent_data_encryption_key_automatic_rotation_enabled = false
      + zone_redundant                                             = (known after apply)
    }

  # module.azure_sql.azurerm_mssql_firewall_rule.allow_specific_ip will be created
  + resource "azurerm_mssql_firewall_rule" "allow_specific_ip" {
      + end_ip_address   = "129.41.46.1"
      + id               = (known after apply)
      + name             = "AllowSpecificIP"
      + server_id        = (known after apply)
      + start_ip_address = "129.41.46.1"
    }

  # module.azure_sql.azurerm_mssql_server.main will be created
  + resource "azurerm_mssql_server" "main" {
      + administrator_login                      = "sqladmin"
      + administrator_login_password             = (sensitive value)
      + connection_policy                        = "Default"
      + express_vulnerability_assessment_enabled = false
      + fully_qualified_domain_name              = (known after apply)
      + id                                       = (known after apply)
      + location                                 = "eastus"
      + minimum_tls_version                      = "1.2"
      + name                                     = "mssqlserver020rojwk"
      + outbound_network_restriction_enabled     = false
      + primary_user_assigned_identity_id        = (known after apply)
      + public_network_access_enabled            = true
      + resource_group_name                      = "rg-infrastructure"
      + restorable_dropped_database_ids          = (known after apply)
      + tags                                     = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
      + version                                  = "12.0"
    }

  # module.azure_sql.azurerm_resource_group.main will be created
  + resource "azurerm_resource_group" "main" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "rg-infrastructure"
      + tags     = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

  # module.network.azurerm_network_security_group.main will be created
  + resource "azurerm_network_security_group" "main" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "nsg"
      + resource_group_name = "rg-infrastructure"
      + security_rule       = (known after apply)
      + tags                = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

  # module.network.azurerm_network_security_rule.rdp will be created
  + resource "azurerm_network_security_rule" "rdp" {
      + access                      = "Allow"
      + destination_address_prefix  = "*"
      + destination_port_ranges     = [
          + "3389",
        ]
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "allow-rdp"
      + network_security_group_name = "nsg"
      + priority                    = 1000
      + protocol                    = "Tcp"
      + resource_group_name         = "rg-infrastructure"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.network.azurerm_public_ip.main will be created
  + resource "azurerm_public_ip" "main" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "eastus"
      + name                    = "public-ip"
      + resource_group_name     = "rg-infrastructure"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

  # module.network.azurerm_subnet.main["0"] will be created
  + resource "azurerm_subnet" "main" {
      + address_prefixes                              = [
          + "10.0.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "subnet-0"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-infrastructure"
      + virtual_network_name                          = "vnet"
    }

  # module.network.azurerm_subnet.main["1"] will be created
  + resource "azurerm_subnet" "main" {
      + address_prefixes                              = [
          + "10.0.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "subnet-1"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-infrastructure"
      + virtual_network_name                          = "vnet"
    }

  # module.network.azurerm_virtual_network.main will be created
  + resource "azurerm_virtual_network" "main" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "eastus"
      + name                           = "vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-infrastructure"
      + subnet                         = (known after apply)
      + tags                           = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

  # module.storage.azurerm_storage_account.main will be created
  + resource "azurerm_storage_account" "main" {
      + access_tier                        = (known after apply)
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = (known after apply)
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "rg-infrastructure"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
    }

  # module.storage.random_string.storage_suffix will be created
  + resource "random_string" "storage_suffix" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.vm.azurerm_network_interface.main will be created
  + resource "azurerm_network_interface" "main" {
      + accelerated_networking_enabled = false
      + applied_dns_servers            = (known after apply)
      + id                             = (known after apply)
      + internal_domain_name_suffix    = (known after apply)
      + ip_forwarding_enabled          = false
      + location                       = "eastus"
      + mac_address                    = (known after apply)
      + name                           = "nic"
      + private_ip_address             = (known after apply)
      + private_ip_addresses           = (known after apply)
      + resource_group_name            = "rg-infrastructure"
      + tags                           = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
      + virtual_machine_id             = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "internal"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + public_ip_address_id                               = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.vm.azurerm_windows_virtual_machine.main will be created
  + resource "azurerm_windows_virtual_machine" "main" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = (known after apply)
      + automatic_updates_enabled                              = (known after apply)
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disk_controller_type                                   = (known after apply)
      + enable_automatic_updates                               = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + hotpatching_enabled                                    = (known after apply)
      + id                                                     = (known after apply)
      + location                                               = "eastus"
      + max_bid_price                                          = -1
      + name                                                   = "win-vm"
      + network_interface_ids                                  = (known after apply)
      + os_managed_disk_id                                     = (known after apply)
      + patch_assessment_mode                                  = (known after apply)
      + patch_mode                                             = (known after apply)
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = (known after apply)
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg-infrastructure"
      + size                                                   = "Standard_D2s_v5"
      + tags                                                   = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Service"     = "terraform-managed"
        }
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = (known after apply)

      + boot_diagnostics {
          + storage_account_uri = (known after apply)
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + id                        = (known after apply)
          + name                      = (known after apply)
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-Datacenter"
          + version   = "latest"
        }
    }

  # module.vm.random_password.admin will be created
  + resource "random_password" "admin" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + public_ip_id    = (known after apply)
  - sql_database_id = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/mssqlserver020rojwk/databases/sqldb-020rojwk" -> null
  - sql_server_id   = "/subscriptions/8be2f576-d66d-49f4-94ee-62d03f0dd825/resourceGroups/rg-infrastructure/providers/Microsoft.Sql/servers/mssqlserver020rojwk" -> null
  + subnet_id       = (known after apply)
  + vm_id           = (known after apply)

```

</details>

*Plan generated at: 2026-02-25T14:08:43.104Z*